#### Raviteja Padala
<img align="left" img src= in.png height = 20 width="20"/>   https://www.linkedin.com/in/raviteja-padala/ <br>

<img align="left" img src= github.png height = 20 width="20"/> https://github.com/raviteja-padala

# Objective: To learn and practice different SQL JOINS



## Contents

1. [SQL JOINS](#1.JOINS) <br> 

2. [CROSS JOIN](#2.CROSS_JOIN) <br>
    
3. [INNER_JOIN](#3.INNER_JOIN) <br>
    
4. [Multiple_JOINS](#4.Multiple_JOINS)<br>
    
5. [SELF_JOIN](#5.SELF_JOIN)<br>

In [2]:
#loading SQLITE
%load_ext sql

In [3]:
#LOADING REQUIRED DATABASE 

%sql sqlite:///movies.db

In [3]:
# view tables in the database
      
%sql SELECT name FROM sqlite_master WHERE type='table'

 * sqlite:///movies.db
Done.

[('actor',),
 ('sqlite_sequence',),
 ('country',),
 ('city',),
 ('address',),
 ('language',),
 ('category',),
 ('customer',),
 ('film',),
 ('film_actor',),
 ('film_category',),
 ('film_text',),
 ('inventory',),
 ('staff',),
 ('store',),
 ('payment',),
 ('rental',)]

# 1.JOINS

* A SQL Join statement combines data or rows from two or more tables based on a common field between them.

* The join clause allows us to retrieve data from two or more related tables into a meaningful result set. We can join the table using a SELECT statement and a join condition.

* Large databases are often prone to data redundancy, i.e., the creation of repetitive data anomalies by insertion, deletion, and updation. But by using SQL Joins, we promote database normalization, which reduces data redundancy and eliminates redundant data.

# 2.CROSS_JOIN
* The Cartesian Join or Cross Join, is the cartesian product of all the rows of the first table with all the rows of the second table. Letâ€™s say we have m rows in the first table and n rows in the second table. Then the resulting cartesian join table will have m*n rows.

In [36]:
%sql select * from STAFF  ;

 * sqlite:///movies.db
Done.

[(1, 'Mike', 'Hillyer', 3, None, 'Mike.Hillyer@sakilastaff.com', 1, 1, 'Mike', '8cb2237d0679ca88db6464eac60da96345513964', '2019-04-11 18:11:48'),
 (2, 'Jon', 'Stephens', 4, None, 'Jon.Stephens@sakilastaff.com', 2, 1, 'Jon', '8cb2237d0679ca88db6464eac60da96345513964', '2019-04-11 18:11:48')]

In [35]:
%sql select * from store  ;

 * sqlite:///movies.db
Done.

[(1, 1, 1, '2019-04-11 18:11:48'), (2, 2, 2, '2019-04-11 18:11:48')]

In [39]:
#cross join of STore and STaff table

%sql SELECT * FROM store CROSS JOIN staff ;

 * sqlite:///movies.db
Done.

[(1, 1, 1, '2019-04-11 18:11:48', 1, 'Mike', 'Hillyer', 3, None, 'Mike.Hillyer@sakilastaff.com', 1, 1, 'Mike', '8cb2237d0679ca88db6464eac60da96345513964', '2019-04-11 18:11:48'),
 (1, 1, 1, '2019-04-11 18:11:48', 2, 'Jon', 'Stephens', 4, None, 'Jon.Stephens@sakilastaff.com', 2, 1, 'Jon', '8cb2237d0679ca88db6464eac60da96345513964', '2019-04-11 18:11:48'),
 (2, 2, 2, '2019-04-11 18:11:48', 1, 'Mike', 'Hillyer', 3, None, 'Mike.Hillyer@sakilastaff.com', 1, 1, 'Mike', '8cb2237d0679ca88db6464eac60da96345513964', '2019-04-11 18:11:48'),
 (2, 2, 2, '2019-04-11 18:11:48', 2, 'Jon', 'Stephens', 4, None, 'Jon.Stephens@sakilastaff.com', 2, 1, 'Jon', '8cb2237d0679ca88db6464eac60da96345513964', '2019-04-11 18:11:48')]

---

# 3.INNER_JOIN 
SQL Inner Join or Equi Join is the simplest join where all rows from the intended tables are cached together if they meet the stated condition. Two or more tables are required for this join. Inner Join can be used with various SQL conditional statements like WHERE, GROUP BY, ORDER BY, etc.

In [4]:
#rental table
%sql select * from rental limit 5;

 * sqlite:///movies.db
Done.

[(1, '2005-05-24 22:53:30.000', 367, 130, '2005-05-26 22:04:30.000', 1, '2019-04-11 18:11:49'),
 (2, '2005-05-24 22:54:33.000', 1525, 459, '2005-05-28 19:40:33.000', 1, '2019-04-11 18:11:49'),
 (3, '2005-05-24 23:03:39.000', 1711, 408, '2005-06-01 22:12:39.000', 1, '2019-04-11 18:11:49'),
 (4, '2005-05-24 23:04:41.000', 2452, 333, '2005-06-03 01:43:41.000', 2, '2019-04-11 18:11:49'),
 (5, '2005-05-24 23:05:21.000', 2079, 222, '2005-06-02 04:33:21.000', 1, '2019-04-11 18:11:49')]

In [5]:
#customer table
%sql select * from customer limit 5;

 * sqlite:///movies.db
Done.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', 5, '1', '2006-02-14 22:04:36.000', '2019-04-11 18:11:49'),
 (2, 1, 'PATRICIA', 'JOHNSON', 'PATRICIA.JOHNSON@sakilacustomer.org', 6, '1', '2006-02-14 22:04:36.000', '2019-04-11 18:11:49'),
 (3, 1, 'LINDA', 'WILLIAMS', 'LINDA.WILLIAMS@sakilacustomer.org', 7, '1', '2006-02-14 22:04:36.000', '2019-04-11 18:11:49'),
 (4, 2, 'BARBARA', 'JONES', 'BARBARA.JONES@sakilacustomer.org', 8, '1', '2006-02-14 22:04:36.000', '2019-04-11 18:11:49'),
 (5, 1, 'ELIZABETH', 'BROWN', 'ELIZABETH.BROWN@sakilacustomer.org', 9, '1', '2006-02-14 22:04:36.000', '2019-04-11 18:11:49')]

In [7]:
#extracting customer name from customer table and rental date from rental table joining both tables
%sql SELECT first_name, last_name, rental_date FROM customer c JOIN rental r ON c.customer_id = r.customer_id limit 5;

 * sqlite:///movies.db
Done.

[('CHARLOTTE', 'HUNTER', '2005-05-24 22:53:30.000'),
 ('TOMMY', 'COLLAZO', '2005-05-24 22:54:33.000'),
 ('MANUEL', 'MURRELL', '2005-05-24 23:03:39.000'),
 ('ANDREW', 'PURDY', '2005-05-24 23:04:41.000'),
 ('DELORES', 'HANSEN', '2005-05-24 23:05:21.000')]

# 4.Multiple_JOINS
* In Scenarios where there will be requirement to extract data from more tables we need to perform multiple joins on tables. 

* Letâ€™s combine the below three tables and extract the relevant data.

In [5]:
#film table

%sql  SELECT film_id , title FROM film limit 5;

 * sqlite:///movies.db
Done.

[(1, 'ACADEMY DINOSAUR'),
 (2, 'ACE GOLDFINGER'),
 (3, 'ADAPTATION HOLES'),
 (4, 'AFFAIR PREJUDICE'),
 (5, 'AFRICAN EGG')]

In [6]:
# category table

%sql  SELECT category_id, name FROM category limit 5;

 * sqlite:///movies.db
Done.

[(1, 'Action'),
 (2, 'Animation'),
 (3, 'Children'),
 (4, 'Classics'),
 (5, 'Comedy')]

In [7]:
# film_category table

%sql  SELECT * FROM film_category limit 5;

 * sqlite:///movies.db
Done.

[(1, 6, '2019-04-11 18:11:49'),
 (2, 11, '2019-04-11 18:11:49'),
 (3, 6, '2019-04-11 18:11:49'),
 (4, 11, '2019-04-11 18:11:49'),
 (5, 8, '2019-04-11 18:11:49')]

> Now we will join the above three tables to extract combined data with film and category

#Syntax: 

  SELECT f.film_id, title, fc.category_id, c.name FROM film f <br>
    -> JOIN film_category fc ON f.film_id = fc.film_id <br>
    -> JOIN category c ON fc.category_id = c.category_id <br>
    -> GROUP BY c.name limit 5; <br>

In [4]:
%sql select f.film_id, title, fc.category_id, c.name FROM film f JOIN film_category fc ON f.film_id = fc.film_id JOIN category c ON fc.category_id = c.category_id GROUP BY c.name  limit 5;

 * sqlite:///movies.db
Done.

[(19, 'AMADEUS HOLY', 1, 'Action'),
 (18, 'ALTER VICTORY', 2, 'Animation'),
 (48, 'BACKLASH UNDEFEATED', 3, 'Children'),
 (14, 'ALICE FANTASIA', 4, 'Classics'),
 (7, 'AIRPLANE SIERRA', 5, 'Comedy')]

# 5.SELF_JOIN

* A self-join is where we query a table and then join the table to itself. A self-join isnâ€™t really an explicit join type. Itâ€™s a way of implementing one of the join types. Itâ€™s more of a joining concept than a join type. This is because you would use a join type (e.g. INNER, LEFT JOIN) with a self-join probably to establish a relationship between them.
* The self-join compares values of the same or different columns in the same table. Only one table is involved in the self-join.

In [8]:
#changing database
%sql sqlite:///music_store.db

In [9]:
#view tables in the database
      
%sql SELECT name FROM sqlite_master WHERE type='table'

   sqlite:///movies.db
 * sqlite:///music_store.db
Done.

[('album',),
 ('artist',),
 ('customer',),
 ('employee',),
 ('genre',),
 ('invoice',),
 ('invoice_line',),
 ('media_type',),
 ('playlist',),
 ('playlist_track',),
 ('track',)]

In [10]:
%sql SELECT * FROM employee limit 5;

   sqlite:///movies.db
 * sqlite:///music_store.db
Done.

[(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2016-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com'),
 (2, 'Edwards', 'Nancy', 'Sales Manager', 1, '1958-12-08 00:00:00', '2016-05-01 00:00:00', '825 8 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 2T3', '+1 (403) 262-3443', '+1 (403) 262-3322', 'nancy@chinookcorp.com'),
 (3, 'Peacock', 'Jane', 'Sales Support Agent', 2, '1973-08-29 00:00:00', '2017-04-01 00:00:00', '1111 6 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 5M5', '+1 (403) 262-3443', '+1 (403) 262-6712', 'jane@chinookcorp.com'),
 (4, 'Park', 'Margaret', 'Sales Support Agent', 2, '1947-09-19 00:00:00', '2017-05-03 00:00:00', '683 10 Street SW', 'Calgary', 'AB', 'Canada', 'T2P 5G3', '+1 (403) 263-4423', '+1 (403) 263-4289', 'margaret@chinookcorp.com'),
 (5, 'Johnson', 'Steve', 'Sales Support Agent', 2, '1965-03-03 00:00:00', '2017-10-17 00:00:00', '7727B 41 Ave', 'Calgary', 'AB', 'Canada', 'T3B 1Y7', '1 (780) 836-9987', '1 (780) 836-9543', 'steve@chinookcorp.com')]

To get the information on who is the direct report of whom, you use the following statement:

#Syntax

SELECT m.first_name || ' ' || m.last_name AS 'Manager', <br>
       e.first_name || ' ' || e.last_name AS 'Direct report' <br>
FROM employee e<br>
INNER JOIN employees m ON m.employee_id = e.reports_to<br>
ORDER BY manager;

In [15]:
%sql SELECT m.first_name || ' ' || m.last_name AS 'Manager', e.first_name || ' ' || e.last_name AS 'Direct report' FROM employee e INNER JOIN employee m ON m.employee_id = e.reports_to ORDER BY manager;

   sqlite:///movies.db
 * sqlite:///music_store.db
Done.

[('Andrew Adams', 'Nancy Edwards'),
 ('Andrew Adams', 'Michael Mitchell'),
 ('Michael Mitchell', 'Robert King'),
 ('Michael Mitchell', 'Laura Callahan'),
 ('Nancy Edwards', 'Jane Peacock'),
 ('Nancy Edwards', 'Margaret Park'),
 ('Nancy Edwards', 'Steve Johnson')]

"SQL joins are like puzzle pieces that fit together perfectly, except sometimes they're as stubborn as mismatched socks in a dryer."

* SQLite does not support Full outer and Right join. We rarely use Right Join and Full Join in daily practice.